hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/inc/hc32m120_usart.h
    uint32_t u32OversamplingBits;       /*!< Oversampling Bits.
                                             This parameter can be a value of @ref USART_Oversampling_Bits */

    uint32_t u32NoiseFilterState;       /*!< RX pin noise filter state.
                                             This parameter can be a value of @ref USART_Noise_Filter_State */

    uint32_t u32SbDetectPolarity;       /*!< Start Bit Detect Polarity.
                                             This parameter can be a value of @ref USART_Start_Bit_Detect_Polarity */

    uint32_t u32HwFlowCtrl;             /*!< Hardware flow control.
                                             This parameter can be a value of @ref USART_HWFLOWCTRL */
} stc_uart_multiprocessor_init_t;

/**
 * @brief LIN mode initialization structure definition
 */
typedef struct
{
    uint32_t u32Baudrate;               /*!< UART baudrate */

    uint32_t u32ClkMode;                /*!< Clock mode.
                                             This parameter can be a value of @ref USART_Clock_Mode */

    uint32_t u32ClkPrescaler;           /*!< Clock prescaler.
                                             This parameter can be a value of @ref USART_Clock_Prescaler_Division */

    uint32_t u32OversamplingBits;       /*!< Oversampling Bits.
                                             This parameter can be a value of @ref USART_Oversampling_Bits */

    uint32_t u32NoiseFilterState;       /*!< RX pin noise filter state.
                                             This parameter can be a value of @ref USART_Noise_Filter_State */

    uint32_t u32SbDetectPolarity;       /*!< Start Bit Detect Polarity.
                                             This parameter can be a value of @ref USART_Start_Bit_Detect_Polarity */
} stc_lin_init_t;

/**
 * @brief CLKSYNC mode initialization structure definition
 */
typedef struct
{
    uint32_t u32Baudrate;               /*!< UART baudrate */

    uint32_t u32ClkMode;                /*!< Clock mode.
                                             This parameter can be a value of @ref USART_Clock_Mode */

    uint32_t u32ClkPrescaler;           /*!< Clock prescaler.
                                             This parameter can be a value of @ref USART_Clock_Prescaler_Division */

    uint32_t u32BitDirection;           /*!< Significant bit.
                                             This parameter can be a value of @ref USART_Significant_Bit */

    uint32_t u32HwFlowCtrl;             /*!< Hardware flow control.
                                             This parameter can be a value of @ref USART_HWFLOWCTRL */
} stc_clksync_init_t;

/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup USART_Global_Macros USART Global Macros
 * @{
 */

/**
 * @defgroup USART_Flag USART Flag
 *        Elements values convention: 0xXXXXXXXX
 *           - 0xXXXXXXXX  : Flag mask in the USART_SR register
 * @{
 */
#define USART_FLAG_PE                           (USART_SR_PE)   /*!< Parity error flag */
#define USART_FLAG_FE                           (USART_SR_FE)   /*!< Framing error flag */
#define USART_FLAG_ORE                          (USART_SR_ORE)  /*!< Overrun error flag */
#define USART_FLAG_RXNE                         (USART_SR_RXNE) /*!< Receive data register not empty flag */
#define USART_FLAG_TC                           (USART_SR_TC)   /*!< Transmission complete flag */
#define USART_FLAG_TXE                          (USART_SR_TXE)  /*!< Transmit data register empty flag */
#define USART_FLAG_MPB                          (USART_SR_MPB)  /*!< Receive processor ID flag */
/**
 * @}
 */

/**
 * @defgroup USART_Transmission_Type USART Transmission Type
 * @{
 */
#define USART_TRANSMISSION_ID                   (USART_DR_MPID)
#define USART_TRANSMISSION_DATA                 ((uint32_t)0x00000000ul)
/**
 * @}
 */

/**
 * @defgroup USART_Clear_Flag USART Clear Flag
 * @{
 */
#define USART_CLEAR_FLAG_PE                     (USART_CR1_CPE)   /*!< Clear Parity error flag */
#define USART_CLEAR_FLAG_FE                     (USART_CR1_CFE)   /*!< Clear Framing error flag */
#define USART_CLEAR_FLAG_ORE                    (USART_CR1_CORE)  /*!< Clear Overrun error flag */
/**
 * @}
 */

/**
 * @defgroup USART_Transmit_Receive_Function USART Transmit/Receive Function
 * @{
 */
#define USART_RX                                (USART_CR1_RE)    /*!< USART RX function */
#define USART_TX                                (USART_CR1_TE)    /*!< USART TX function */
#define USART_INT_RX                            (USART_CR1_RIE)   /*!< USART RX interrupt function */
#define USART_INT_TC                            (USART_CR1_TCIE)  /*!< USART transmission complete interrupt */
#define USART_INT_TXE                           (USART_CR1_TXEIE) /*!< Transmit data register empty interrupt */
/**
 * @}
 */

/**
 * @defgroup USART_Silence_Mode_State USART Silence Mode State
 * @{
 */
#define USART_UART_SILENCE_MODE                 (USART_CR1_SLME)          /*!< UART silence mode */
#define USART_UART_NORMAL_MODE                  ((uint32_t)0x00000000ul)  /*!< UART normal mode */
/**
 * @}
 */

/**
 * @defgroup USART_Parity_Control USART Parity Control
 * @{
 */
#define USART_PARITY_NONE                       ((uint32_t)0x00000000ul)        /*!< Parity control disabled */
#define USART_PARITY_EVEN                       (USART_CR1_PCE)                 /*!< Parity control enabled and Even Parity is selected */
#define USART_PARITY_ODD                        (USART_CR1_PCE | USART_CR1_PS)  /*!< Parity control enabled and Odd Parity is selected */
/**
 * @}
 */

/**
 * @defgroup USART_Data_Width_Bits Data Width Bits
 * @{
 */
#define USART_DATA_WIDTH_BITS_9                 (USART_CR1_M)           /*!< 9 bits word length : Start bit, 9 data bits, n stop bits */
#define USART_DATA_WIDTH_BITS_8                 ((uint32_t)0x00000000ul)/*!< 8 bits word length : Start bit, 8 data bits, n stop bits */
/**
 * @}
 */

/**
 * @defgroup USART_Oversampling_Bits USART Oversampling Bits
 * @{
 */
#define USART_OVERSAMPLING_BITS_8                (USART_CR1_OVER8)        /*!< Oversampling by 8 bits */
#define USART_OVERSAMPLING_BITS_16               ((uint32_t)0x00000000ul) /*!< Oversampling by 16 bits */
/**
 * @}
 */

/**
 * @defgroup USART_Mode_Selection USART Mode Selection
 * @{
 */
#define USART_MODE_UART                          ((uint32_t)0x00000000ul) /*!< UART mode */
#define USART_MODE_CLKSYNC                       (USART_CR1_MS)           /*!< Clock synchronization */
/**
 * @}
 */

/**
 * @defgroup USART_Significant_Bit USART Significant Bit
 * @{
 */
#define USART_MSB                               (USART_CR1_ML)            /*!< MSB(Most Significant Bit) */
#define USART_LSB                               ((uint32_t)0x00000000ul)  /*!< LSB(Least Significant Bit) */
/**
 * @}
 */

/**
 * @defgroup USART_Noise_Filter_State USART Noise Filter State
 * @{
 */
#define USART_NOISE_FILTER_ENABLE               (USART_CR1_NFE)           /*!< Enable noise filter */
#define USART_NOISE_FILTER_DISABLE              ((uint32_t)0x00000000ul)  /*!< Disable noise filter */
/**
 * @}
 */

/**
 * @defgroup USART_Start_Bit_Detect_Polarity USART Start Bit Detect Polarity
 * @{
 */
#define USART_SB_DETECT_FALLING                 (USART_CR1_SBS)           /*!< Detect RX pin falling edge */
#define USART_SB_DETECT_LOW                     ((uint32_t)0x00000000ul)  /*!< Detect RX pin low level */
/**
 * @}
 */

/**
 * @defgroup USART_Multiple_Processor_State USART Multiple Processor State
 * @{
 */
#define USART_MULTIPLE_PROCESSOR_ENABLE         (USART_CR2_MPE)           /*!< Enable multiple processor function */
#define USART_MULTIPLE_PROCESSOR_DISABLE        ((uint32_t)0x00000000ul)  /*!< Disable multiple processor function */
/**
 * @}
 */

/**
 * @defgroup USART_Clock_Mode USART Clock Mode Selection
 * @{
 */
#define USART_EXTCLK                            (USART_CR2_CLKC_1)        /*!< Select external clock source. */
#define USART_INTCLK_OUTPUT                     (USART_CR2_CLKC_0)        /*!< Select internal clock source and output clock. */
#define USART_INTCLK_NONE_OUTPUT                ((uint32_t)0x00000000ul)  /*!< Select internal clock source and don't output clock */
/**
 * @}
 */

/**
 * @defgroup USART_Stop_Bits USART Stop Bits
 * @{
 */
#define USART_STOP_BITS_2                       (USART_CR2_STOP)          /*!< 2 stop bit */
#define USART_STOP_BITS_1                       ((uint32_t)0x00000000ul)  /*!< 1 stop bit */
/**
 * @}
 */

/**
 * @defgroup USART_LIN_Mode_State USART LIN Mode State
 * @{
 */
#define USART_LIN_MODE_ENABLE                   (USART_CR2_LINEN)         /*!< Enable LIN mode */
#define USART_LIN_MODE_DISABLE                  ((uint32_t)0x00000000ul)  /*!< Disable LIN mode */
/**
 * @}
 */

/**
 * @defgroup USART_HALFDUPLEX_FULLDUPLEX_SEL USART Half-duplex/Full-duplex Selection
 * @{
 */
#define USART_HALFDUPLEX_MODE                   (USART_CR3_HDSEL)         /*!< USART half-duplex mode */
#define USART_FULLDUPLEX_MODE                   ((uint32_t)0x00000000ul)  /*!< USART full-duplex mode */
/**
 * @}
 */

/**
 * @defgroup USART_HWFLOWCTRL USART Hardware Flow Control CTS/RTS
 * @{
 */
#define USART_HWFLOWCTRL_CTS                    (USART_CR3_CTSE)          /*!< UART hardware flow control CTS mode */
#define USART_HWFLOWCTRL_RTS                    ((uint32_t)0x00000000ul)  /*!< UART hardware flow control RTS mode */
/**
 * @}
 */

/**
 * @defgroup USART_Clock_Prescaler_Division USART Clock Prescaler Division
 * @{
 */
#define USART_CLK_PRESCALER_DIV1                ((uint32_t)0x00000000ul)  /*!< PCLK */
#define USART_CLK_PRESCALER_DIV4                (USART_PR_PSC_0)          /*!< PCLK/4 */
#define USART_CLK_PRESCALER_DIV16               (USART_PR_PSC_1)          /*!< PCLK/16 */
#define USART_CLK_PRESCALER_DIV64               (USART_PR_PSC)            /*!< PCLK/64 */
/**
 * @}
 */

/**
 * @}
 */

