hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/inc/hc32m120_usart.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup USART_Global_Functions
 * @{
 */

/**
 * @brief  Enable USART noise filter.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_EnableNoiseFilter(M0P_USART_TypeDef *USARTx)
{
    SET_REG32_BIT(USARTx->CR1, USART_CR1_NFE);
}

/**
 * @brief  Disable USART noise filter.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_DisableNoiseFilter(M0P_USART_TypeDef *USARTx)
{
    CLEAR_REG32_BIT(USARTx->CR1, USART_CR1_NFE);
}

/**
 * @brief  Enable UART multiple processor function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_EnableMultProcessor(M0P_USART_TypeDef *USARTx)
{
    SET_REG32_BIT(USARTx->CR2, USART_CR2_MPE);
}

/**
 * @brief  Disable UART multiple processor function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_DisableMultProcessor(M0P_USART_TypeDef *USARTx)
{
    CLEAR_REG32_BIT(USARTx->CR2, USART_CR2_MPE);
}

/**
 * @brief  Enable UART LIN function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_EnableLIN(M0P_USART_TypeDef *USARTx)
{
    SET_REG32_BIT(USARTx->CR1, USART_CR2_LINEN);
}

/**
 * @brief  Disable UART LIN function.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval None
 */
__STATIC_INLINE void USART_DisableLIN(M0P_USART_TypeDef *USARTx)
{
    CLEAR_REG32_BIT(USARTx->CR2, USART_CR2_LINEN);
}

/**
 * @brief  USART receive data.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 * @retval Receive data
 */
__STATIC_INLINE uint16_t USART_RecData(M0P_USART_TypeDef *USARTx)
{
    return (uint16_t)(READ_REG32(USARTx->DR) >> USART_DR_RDR_POS);
}

/**
 * @brief  USART send data.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 ** \param [in] u16Data                 Transmit data
 * @retval None
 */
__STATIC_INLINE void USART_SendData(M0P_USART_TypeDef *USARTx,
                                            uint16_t u16Data)
{
    WRITE_REG32(USARTx->DR,  ((uint32_t)u16Data & 0x01FFul));
}

/**
 * @brief  USART send processor ID.
 * @param  [in] USARTx                  Pointer to USART instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_USART1:           USART unit 1 instance register base
 *           @arg M0P_USART2:           USART unit 2 instance register base
 *           @arg M0P_USART3:           USART unit 3 instance register base
 ** \param [in] u16ID                   Processor ID
 * @retval None
 */
__STATIC_INLINE void USART_SendId(M0P_USART_TypeDef *USARTx,
                                        uint16_t u16ID)
{
    WRITE_REG32(USARTx->DR, (USART_DR_MPID | ((uint32_t)u16ID & 0x01FFul)));
}

en_result_t USART_UartInit(M0P_USART_TypeDef *USARTx,
                            const stc_uart_init_t *pstcInit);
en_result_t USART_HalfDuplexInit(M0P_USART_TypeDef *USARTx,
                                            const stc_uart_init_t *pstcInit);
en_result_t USART_UartStructInit(stc_uart_init_t *pstcInit);
en_result_t USART_MultiProcessorInit(M0P_USART_TypeDef *USARTx,
                                const stc_uart_multiprocessor_init_t *pstcInit);
en_result_t UART_MultiProcessorStructInit(stc_uart_multiprocessor_init_t *pstcInit);
en_result_t USART_LinInit(M0P_USART_TypeDef *USARTx,
                                const stc_lin_init_t *pstcInit);
en_result_t USART_LinStructInit(stc_lin_init_t *pstcInit);
en_result_t USART_ClkSyncInit(M0P_USART_TypeDef *USARTx,
                                        const stc_clksync_init_t *pstcInit);
en_result_t USART_ClkSyncStructInit(stc_clksync_init_t *pstcInit);
en_result_t USART_DeInit(M0P_USART_TypeDef *USARTx);

en_result_t USART_FuncCmd(M0P_USART_TypeDef *USARTx,
                            uint32_t u32Func,
                            en_functional_state_t enNewSta);
en_functional_state_t USART_GetFuncState(M0P_USART_TypeDef *USARTx,
                            uint32_t u32Func);
en_flag_status_t USART_GetFlag(M0P_USART_TypeDef *USARTx,
                                        uint32_t u32Flag);
en_result_t USART_SilenceModeCmd(M0P_USART_TypeDef *USARTx, en_functional_state_t enNewSta);
en_functional_state_t USART_GetSilenceModeState(M0P_USART_TypeDef *USARTx);
en_result_t USART_ClearFlag(M0P_USART_TypeDef *USARTx, uint32_t u32Flag);
en_result_t USART_SetTransmissionType(M0P_USART_TypeDef *USARTx,
                                            uint32_t u32Type);
uint32_t USART_GetTransmissionType(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetParity(M0P_USART_TypeDef *USARTx, uint32_t u32Parity);
uint32_t USART_GetParity(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetDataWidth(M0P_USART_TypeDef *USARTx,
                                    uint32_t u32DataWidth);
uint32_t USART_GetDataWidth(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetOversmaplingBits(M0P_USART_TypeDef *USARTx,
                                            uint32_t u32OversamplingBits);
uint32_t USART_GetOversmaplingBits(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetMode(M0P_USART_TypeDef *USARTx, uint32_t u32Mode);
uint32_t USART_GetMode(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetBitDirection(M0P_USART_TypeDef *USARTx,
                                        uint32_t u32BitDir);
uint32_t USART_GetBitDirection(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetSbDetectPolarity(M0P_USART_TypeDef *USARTx,
                                            uint32_t u32Polarity);
uint32_t USART_GetSbDetectPolarity(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetClockMode(M0P_USART_TypeDef *USARTx, uint32_t u32ClkMode);
uint32_t USART_GetClockMode(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetStopBits(M0P_USART_TypeDef *USARTx, uint32_t u32StopBits);
uint32_t USART_GetStopBits(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetDuplexMode(M0P_USART_TypeDef *USARTx,
                                uint32_t u32Mode);
uint32_t USART_GetDuplexMode(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetHwFlowCtrl(M0P_USART_TypeDef *USARTx,
                                uint32_t u32HwFlowCtrl);
uint32_t USART_GetHwFlowCtrl(M0P_USART_TypeDef *USARTx);
en_result_t USART_SetClkPrescaler(M0P_USART_TypeDef *USARTx,
                                    uint32_t u32PrescalerDiv);
uint32_t USART_GetClkPrescaler(M0P_USART_TypeDef *USARTx);

en_result_t USART_SetBaudrate(M0P_USART_TypeDef *USARTx,
                                    uint32_t u32Baudrate,
                                    float32_t *pf32Err);

/**
 * @}
 */

#endif /* DDL_USART_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M120_USART_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
